Console.WriteLine("یک فروشگاه کتاب این بخش ها را دارد :\n" +
    "\nمشتری ثبت‌نام می‌کند." +
    "\nکتاب‌ها را مشاهده می‌کند." +
    "\nکتاب را به سبد خرید اضافه می‌کند." +
    "\nسفارش ثبت می‌کند." +
    "\nپرداخت انجام می‌دهد." +
    "\nمسئول  کتاب‌ها را مدیریت می‌کند");



Console.WriteLine(" هر یوزر نماینده مشتری یا مدیر سیستم است");
Console.WriteLine("هر کتاب یک نویسنده دارد.");
Console.WriteLine(" هر کتاب در دسته بندی مختلفی قرار میگیرد مثلا رمان-علمی- تاریخی");
Console.WriteLine("هر کاربر یک سبد خرید دارد.");
Console.WriteLine(" Order با نهایی شدن خرید سبد به سفارش تبدیل میشه");
Console.WriteLine("OrderItem یک سفارش شامل چند کتاب است");
Console.WriteLine("payment شامل اطلاعات پرداخت است");
